Autodesk.Revit.DB.AnnotationCleanupResult.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.AnnotationCleanupResult.ResultId
Cleanup result id
Since:
2027

Autodesk.Revit.DB.AnnotationCleanupResult.ThumbnailData
Cleanup result thumbnail
Since:
2027

Autodesk.Revit.DB.AnnotationCleanupResult
A class provide annotation cleanup result data.
Since:
2027